zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_spi.h
/* SPI_DATA */
#define SPI_DATA_DATA                   BITS(0,15)                               /*!< data transfer register */

/* SPI_CRCPOLY */
#define SPI_CRCPOLY_CPR                 BITS(0,15)                               /*!< CRC polynomial register */

/* SPI_RCRC */
#define SPI_RCRC_RCR                    BITS(0,15)                               /*!< RX CRC register */

/* SPI_TCRC */
#define SPI_TCRC_TCR                    BITS(0,15)                               /*!< RX CRC register */

/* SPI_I2SCTL */
#define SPI_I2SCTL_CHLEN                BIT(0)                                   /*!< channel length */
#define SPI_I2SCTL_DTLEN                BITS(1,2)                                /*!< data length */
#define SPI_I2SCTL_CKPL                 BIT(3)                                   /*!< idle state clock polarity */
#define SPI_I2SCTL_I2SSTD               BITS(4,5)                                /*!< I2S standard selection */
#define SPI_I2SCTL_PCMSMOD              BIT(7)                                   /*!< PCM frame synchronization mode */
#define SPI_I2SCTL_I2SOPMOD             BITS(8,9)                                /*!< I2S operation mode */
#define SPI_I2SCTL_I2SEN                BIT(10)                                  /*!< I2S enable */
#define SPI_I2SCTL_I2SSEL               BIT(11)                                  /*!< I2S mode selection */

/* SPI_I2SPSC */
#define SPI_I2SPSC_DIV                  BITS(0,7)                                /*!< dividing factor for the prescaler */
#define SPI_I2SPSC_OF                   BIT(8)                                   /*!< odd factor for the prescaler */
#define SPI_I2SPSC_MCKOEN               BIT(9)                                   /*!< I2S MCK output enable */

/* SPI_QCTL(only for SPI1) */
#define SPI_QCTL_QMOD                   BIT(0)                                   /*!< quad-SPI mode enable */
#define SPI_QCTL_QRD                    BIT(1)                                   /*!< quad-SPI mode read select */
#define SPI_QCTL_IO23_DRV               BIT(2)                                   /*!< drive SPI_IO2 and SPI_IO3 enable */

/* constants definitions */
/* SPI and I2S parameter struct definitions */
typedef struct {
    uint32_t device_mode;                                                        /*!< SPI master or slave */
    uint32_t trans_mode;                                                         /*!< SPI transfer type */
    uint32_t frame_size;                                                         /*!< SPI frame size */
    uint32_t nss;                                                                /*!< SPI NSS control by handware or software */
    uint32_t endian;                                                             /*!< SPI big endian or little endian */
    uint32_t clock_polarity_phase;                                               /*!< SPI clock phase and polarity */
    uint32_t prescale;                                                           /*!< SPI prescale factor */
} spi_parameter_struct;

/* SPI mode definitions */
#define SPI_MASTER                      (SPI_CTL0_MSTMOD | SPI_CTL0_SWNSS)       /*!< SPI as master */
#define SPI_SLAVE                       ((uint32_t)0x00000000U)                  /*!< SPI as slave */

/* SPI bidirectional transfer direction */
#define SPI_BIDIRECTIONAL_TRANSMIT      SPI_CTL0_BDOEN                           /*!< SPI work in transmit-only mode */
#define SPI_BIDIRECTIONAL_RECEIVE       (~SPI_CTL0_BDOEN)                        /*!< SPI work in receive-only mode */

/* SPI transmit type */
#define SPI_TRANSMODE_FULLDUPLEX        ((uint32_t)0x00000000U)                  /*!< SPI receive and send data at fullduplex communication */
#define SPI_TRANSMODE_RECEIVEONLY       SPI_CTL0_RO                              /*!< SPI only receive data */
#define SPI_TRANSMODE_BDRECEIVE         SPI_CTL0_BDEN                            /*!< bidirectional receive data */
#define SPI_TRANSMODE_BDTRANSMIT        (SPI_CTL0_BDEN | SPI_CTL0_BDOEN)         /*!< bidirectional transmit data*/

/* SPI NSS control mode */
#define SPI_NSS_SOFT                    SPI_CTL0_SWNSSEN                         /*!< SPI NSS control by sofrware */
#define SPI_NSS_HARD                    ((uint32_t)0x00000000U)                  /*!< SPI NSS control by hardware */

/* SPI transmit way */
#define SPI_ENDIAN_MSB                  ((uint32_t)0x00000000U)                  /*!< SPI transmit way is big endian: transmit MSB first */
#define SPI_ENDIAN_LSB                  SPI_CTL0_LF                              /*!< SPI transmit way is little endian: transmit LSB first */

/* SPI clock phase and polarity */
#define SPI_CK_PL_LOW_PH_1EDGE          ((uint32_t)0x00000000U)                  /*!< SPI clock polarity is low level and phase is first edge */
#define SPI_CK_PL_HIGH_PH_1EDGE         SPI_CTL0_CKPL                            /*!< SPI clock polarity is high level and phase is first edge */
#define SPI_CK_PL_LOW_PH_2EDGE          SPI_CTL0_CKPH                            /*!< SPI clock polarity is low level and phase is second edge */
#define SPI_CK_PL_HIGH_PH_2EDGE         (SPI_CTL0_CKPL | SPI_CTL0_CKPH)          /*!< SPI clock polarity is high level and phase is second edge */

/* SPI clock prescale factor */
#define CTL0_PSC(regval)                (BITS(3,5) & (uint32_t)((uint32_t)(regval) << 3U))
#define SPI_PSC_2                       CTL0_PSC(0U)                             /*!< SPI clock prescale factor is 2 */
#define SPI_PSC_4                       CTL0_PSC(1U)                             /*!< SPI clock prescale factor is 4 */
#define SPI_PSC_8                       CTL0_PSC(2U)                             /*!< SPI clock prescale factor is 8 */
#define SPI_PSC_16                      CTL0_PSC(3U)                             /*!< SPI clock prescale factor is 16 */
#define SPI_PSC_32                      CTL0_PSC(4U)                             /*!< SPI clock prescale factor is 32 */
#define SPI_PSC_64                      CTL0_PSC(5U)                             /*!< SPI clock prescale factor is 64 */
#define SPI_PSC_128                     CTL0_PSC(6U)                             /*!< SPI clock prescale factor is 128 */
#define SPI_PSC_256                     CTL0_PSC(7U)                             /*!< SPI clock prescale factor is 256 */

/* SPIx frame size */
#define CTL1_FRAMESIZE(regval)          (BITS(8,11) & (uint32_t)((uint32_t)(regval) << 8U))
#define SPI_FRAMESIZE_4BIT              CTL1_FRAMESIZE(3U)                       /*!< SPI frame size is 4 bits */
#define SPI_FRAMESIZE_5BIT              CTL1_FRAMESIZE(4U)                       /*!< SPI frame size is 5 bits */
#define SPI_FRAMESIZE_6BIT              CTL1_FRAMESIZE(5U)                       /*!< SPI frame size is 6 bits */
#define SPI_FRAMESIZE_7BIT              CTL1_FRAMESIZE(6U)                       /*!< SPI frame size is 7 bits */
#define SPI_FRAMESIZE_8BIT              CTL1_FRAMESIZE(7U)                       /*!< SPI frame size is 8 bits */
#define SPI_FRAMESIZE_9BIT              CTL1_FRAMESIZE(8U)                       /*!< SPI frame size is 9 bits */
#define SPI_FRAMESIZE_10BIT             CTL1_FRAMESIZE(9U)                       /*!< SPI frame size is 10 bits */
#define SPI_FRAMESIZE_11BIT             CTL1_FRAMESIZE(10U)                      /*!< SPI frame size is 11 bits */
#define SPI_FRAMESIZE_12BIT             CTL1_FRAMESIZE(11U)                      /*!< SPI frame size is 12 bits */
#define SPI_FRAMESIZE_13BIT             CTL1_FRAMESIZE(12U)                      /*!< SPI frame size is 13 bits */
#define SPI_FRAMESIZE_14BIT             CTL1_FRAMESIZE(13U)                      /*!< SPI frame size is 14 bits */
#define SPI_FRAMESIZE_15BIT             CTL1_FRAMESIZE(14U)                      /*!< SPI frame size is 15 bits */
#define SPI_FRAMESIZE_16BIT             CTL1_FRAMESIZE(15U)                      /*!< SPI frame size is 16 bits */

/* SPIx CRC length(x=1) */
#define SPI_CRC_8BIT                    ((uint32_t)0x00000000U)                  /*!< SPI CRC length is 8 bits */
#define SPI_CRC_16BIT                   SPI_CTL0_CRCL                            /*!< SPI CRC length is 16 bits */

/* SPIx byte access enable(x=1) */
#define SPI_HALFWORD_ACCESS             ((uint32_t)0x00000000U)                  /*!< SPI half-word access to FIFO */
#define SPI_BYTE_ACCESS                 SPI_CTL1_BYTEN                           /*!< SPI byte access to FIFO */

