zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_spi.h
/* SPIx odd bytes in TX DMA channel(x=1) */
#define SPI_TXDMA_EVEN                  ((uint32_t)0x00000000U)                  /*!< SPI number of byte in TX DMA channel is even */
#define SPI_TXDMA_ODD                   SPI_CTL1_TXDMA_ODD                       /*!< SPI number of byte in TX DMA channel is odd */

/* SPIx odd bytes in RX DMA channel(x=1) */
#define SPI_RXDMA_EVEN                  ((uint32_t)0x00000000U)                  /*!< SPI number of byte in RX DMA channel is even */
#define SPI_RXDMA_ODD                   SPI_CTL1_RXDMA_ODD                       /*!< SPI number of byte in RX DMA channel is odd */

/* SPIx TXFIFO level(x=1) */
#define CTL1_TXLVL(regval)              (BITS(11,12) & ((uint32_t)(regval) << 11U))
#define SPI_TXLVL_EMPTY                 CTL1_TXLVL(0U)                           /*!< SPI TXFIFO is empty */
#define SPI_TXLVL_QUARTER_FULL          CTL1_TXLVL(1U)                           /*!< SPI TXFIFO is a quarter of full */
#define SPI_TXLVL_HALF_FULL             CTL1_TXLVL(2U)                           /*!< SPI TXFIFO is a half of full */
#define SPI_TXLVL_FULL                  CTL1_TXLVL(3U)                           /*!< SPI TXFIFO is full */

/* SPIx RXFIFO level(x=1) */
#define CTL1_RXLVL(regval)              (BITS(9,10) & ((uint32_t)(regval) << 9U))
#define SPI_RXLVL_EMPTY                 CTL1_RXLVL(0U)                           /*!< SPI RXFIFO is empty */
#define SPI_RXLVL_QUARTER_FULL          CTL1_RXLVL(1U)                           /*!< SPI RXFIFO is a quarter of full */
#define SPI_RXLVL_HALF_FULL             CTL1_RXLVL(2U)                           /*!< SPI RXFIFO is a half of full */
#define SPI_RXLVL_FULL                  CTL1_RXLVL(3U)                           /*!< SPI RXFIFO is full */

/* I2S audio sample rate */
#define I2S_AUDIOSAMPLE_8K              ((uint32_t)8000U)                        /*!< I2S audio sample rate is 8KHz */
#define I2S_AUDIOSAMPLE_11K             ((uint32_t)11025U)                       /*!< I2S audio sample rate is 11KHz */
#define I2S_AUDIOSAMPLE_16K             ((uint32_t)16000U)                       /*!< I2S audio sample rate is 16KHz */
#define I2S_AUDIOSAMPLE_22K             ((uint32_t)22050U)                       /*!< I2S audio sample rate is 22KHz */
#define I2S_AUDIOSAMPLE_32K             ((uint32_t)32000U)                       /*!< I2S audio sample rate is 32KHz */
#define I2S_AUDIOSAMPLE_44K             ((uint32_t)44100U)                       /*!< I2S audio sample rate is 44KHz */
#define I2S_AUDIOSAMPLE_48K             ((uint32_t)48000U)                       /*!< I2S audio sample rate is 48KHz */
#define I2S_AUDIOSAMPLE_96K             ((uint32_t)96000U)                       /*!< I2S audio sample rate is 96KHz */
#define I2S_AUDIOSAMPLE_192K            ((uint32_t)192000U)                      /*!< I2S audio sample rate is 192KHz */

/* I2S frame format */
#define I2SCTL_DTLEN(regval)            (BITS(1,2) & ((uint32_t)(regval) << 1U))
#define I2S_FRAMEFORMAT_DT16B_CH16B     I2SCTL_DTLEN(0U)                         /*!< I2S data length is 16 bit and channel length is 16 bit */
#define I2S_FRAMEFORMAT_DT16B_CH32B     (I2SCTL_DTLEN(0U) | SPI_I2SCTL_CHLEN)    /*!< I2S data length is 16 bit and channel length is 32 bit */
#define I2S_FRAMEFORMAT_DT24B_CH32B     (I2SCTL_DTLEN(1U) | SPI_I2SCTL_CHLEN)    /*!< I2S data length is 24 bit and channel length is 32 bit */
#define I2S_FRAMEFORMAT_DT32B_CH32B     (I2SCTL_DTLEN(2U) | SPI_I2SCTL_CHLEN)    /*!< I2S data length is 32 bit and channel length is 32 bit */

/* I2S master clock output */
#define I2S_MCKOUT_DISABLE              ((uint32_t)0x00000000U)                  /*!< I2S master clock output disable */
#define I2S_MCKOUT_ENABLE               SPI_I2SPSC_MCKOEN                        /*!< I2S master clock output enable */

/* I2S operation mode */
#define I2SCTL_I2SOPMOD(regval)         (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define I2S_MODE_SLAVETX                I2SCTL_I2SOPMOD(0U)                      /*!< I2S slave transmit mode */
#define I2S_MODE_SLAVERX                I2SCTL_I2SOPMOD(1U)                      /*!< I2S slave receive mode */
#define I2S_MODE_MASTERTX               I2SCTL_I2SOPMOD(2U)                      /*!< I2S master transmit mode */
#define I2S_MODE_MASTERRX               I2SCTL_I2SOPMOD(3U)                      /*!< I2S master receive mode */

/* I2S standard */
#define I2SCTL_I2SSTD(regval)           (BITS(4,5) & ((uint32_t)(regval) << 4U))
#define I2S_STD_PHILLIPS                I2SCTL_I2SSTD(0U)                        /*!< I2S phillips standard */
#define I2S_STD_MSB                     I2SCTL_I2SSTD(1U)                        /*!< I2S MSB standard */
#define I2S_STD_LSB                     I2SCTL_I2SSTD(2U)                        /*!< I2S LSB standard */
#define I2S_STD_PCMSHORT                I2SCTL_I2SSTD(3U)                        /*!< I2S PCM short standard */
#define I2S_STD_PCMLONG                 (I2SCTL_I2SSTD(3U) | SPI_I2SCTL_PCMSMOD) /*!< I2S PCM long standard */

/* I2S clock polarity */
#define I2S_CKPL_LOW                    ((uint32_t)0x00000000U)                  /*!< I2S clock polarity low level */
#define I2S_CKPL_HIGH                   SPI_I2SCTL_CKPL                          /*!< I2S clock polarity high level */

/* SPI DMA constants definitions */
#define SPI_DMA_TRANSMIT                ((uint8_t)0x00U)                         /*!< SPI transmit data use DMA */
#define SPI_DMA_RECEIVE                 ((uint8_t)0x01U)                         /*!< SPI receive data use DMA */

/* SPI CRC constants definitions */
#define SPI_CRC_TX                      ((uint8_t)0x00U)                         /*!< SPI transmit CRC value */
#define SPI_CRC_RX                      ((uint8_t)0x01U)                         /*!< SPI receive CRC value */

/* SPI/I2S interrupt enable/disable constants definitions */
#define SPI_I2S_INT_TBE                 SPI_CTL1_TBEIE                           /*!< transmit buffer empty interrupt */
#define SPI_I2S_INT_RBNE                SPI_CTL1_RBNEIE                          /*!< receive buffer not empty interrupt */
#define SPI_I2S_INT_ERR                 SPI_CTL1_ERRIE                           /*!< error interrupt */

