zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_spi.h
/* SPI/I2S interrupt flag constants definitions */
#define SPI_I2S_INT_FLAG_TBE            ((uint8_t)0x00U)                         /*!< transmit buffer empty interrupt flag */
#define SPI_I2S_INT_FLAG_RBNE           ((uint8_t)0x01U)                         /*!< receive buffer not empty interrupt flag */
#define SPI_I2S_INT_FLAG_RXORERR        ((uint8_t)0x02U)                         /*!< overrun interrupt flag */
#define SPI_INT_FLAG_CONFERR            ((uint8_t)0x03U)                         /*!< config error interrupt flag */
#define SPI_INT_FLAG_CRCERR             ((uint8_t)0x04U)                         /*!< CRC error interrupt flag */
#define SPI_I2S_INT_FLAG_FERR           ((uint8_t)0x05U)                         /*!< format error interrupt flag */
#define I2S_INT_FLAG_TXURERR            ((uint8_t)0x06U)                         /*!< underrun error interrupt flag */

/* SPI/I2S flag definitions */
#define SPI_FLAG_RBNE                   SPI_STAT_RBNE                            /*!< receive buffer not empty flag */
#define SPI_FLAG_TBE                    SPI_STAT_TBE                             /*!< transmit buffer empty flag */
#define SPI_FLAG_CRCERR                 SPI_STAT_CRCERR                          /*!< CRC error flag */
#define SPI_FLAG_CONFERR                SPI_STAT_CONFERR                         /*!< mode config error flag */
#define SPI_FLAG_RXORERR                SPI_STAT_RXORERR                         /*!< receive overrun error flag */
#define SPI_FLAG_TRANS                  SPI_STAT_TRANS                           /*!< transmit on-going flag */
#define SPI_FLAG_FERR                   SPI_STAT_FERR                            /*!< format error flag */
#define I2S_FLAG_RBNE                   SPI_STAT_RBNE                            /*!< receive buffer not empty flag */
#define I2S_FLAG_TBE                    SPI_STAT_TBE                             /*!< transmit buffer empty flag */
#define I2S_FLAG_CH                     SPI_STAT_I2SCH                           /*!< channel side flag */
#define I2S_FLAG_TXURERR                SPI_STAT_TXURERR                         /*!< underrun error flag */
#define I2S_FLAG_RXORERR                SPI_STAT_RXORERR                         /*!< overrun error flag */
#define I2S_FLAG_TRANS                  SPI_STAT_TRANS                           /*!< transmit on-going flag */
#define I2S_FLAG_FERR                   SPI_STAT_FERR                            /*!< format error flag */
#define SPI_FLAG_TXLVL_EMPTY            ((uint32_t)0x10000000U)                  /*!< SPI TXFIFO is empty flag */
#define SPI_FLAG_TXLVL_QUARTER_FULL     SPI_TXLVL_QUARTER_FULL                   /*!< SPI TXFIFO is a quarter of full flag */
#define SPI_FLAG_TXLVL_HALF_FULL        SPI_TXLVL_HALF_FULL                      /*!< SPI TXFIFO is a half of full flag */
#define SPI_FLAG_TXLVL_FULL             SPI_TXLVL_FULL                           /*!< SPI TXFIFO is full flag */
#define SPI_FLAG_RXLVL_EMPTY            ((uint32_t)0x20000000U)                  /*!< SPI RXFIFO is empty flag */
#define SPI_FLAG_RXLVL_QUARTER_FULL     SPI_RXLVL_QUARTER_FULL                   /*!< SPI RXFIFO is a quarter of full flag */
#define SPI_FLAG_RXLVL_HALF_FULL        SPI_RXLVL_HALF_FULL                      /*!< SPI RXFIFO is a half of full flag */
#define SPI_FLAG_RXLVL_FULL             SPI_RXLVL_FULL                           /*!< SPI RXFIFO is full flag */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check I2S audio sample rate */
#define NOT_VALID_I2S_AUDIOSAMPLE(i2s_audiosample)        ((i2s_audiosample) == 0U)
#endif/* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* initialization functions */
/* reset SPI and I2S */
void spi_i2s_deinit(uint32_t spi_periph);
/* initialize the parameters of SPI struct with the default values */
void spi_struct_para_init(spi_parameter_struct *spi_struct);
/* initialize SPI parameter */
ErrStatus spi_init(uint32_t spi_periph, spi_parameter_struct *spi_struct);
/* enable SPI */
void spi_enable(uint32_t spi_periph);
/* disable SPI */
void spi_disable(uint32_t spi_periph);

/* initialize I2S parameter */
void i2s_init(uint32_t spi_periph, uint32_t i2s_mode, uint32_t i2s_standard, uint32_t i2s_ckpl);
/* configure I2S prescaler */
void i2s_psc_config(uint32_t spi_periph, uint32_t i2s_audiosample, uint32_t i2s_frameformat, uint32_t i2s_mckout);
/* enable I2S */
void i2s_enable(uint32_t spi_periph);
/* disable I2S */
void i2s_disable(uint32_t spi_periph);

/* NSS functions */
/* enable SPI NSS output */
void spi_nss_output_enable(uint32_t spi_periph);
/* disable SPI NSS output */
void spi_nss_output_disable(uint32_t spi_periph);
/* SPI NSS pin high level in software mode */
void spi_nss_internal_high(uint32_t spi_periph);
/* SPI NSS pin low level in software mode */
void spi_nss_internal_low(uint32_t spi_periph);

/* SPI DMA functions */
/* enable SPI DMA */
void spi_dma_enable(uint32_t spi_periph, uint8_t dma);
/* disable SPI DMA */
void spi_dma_disable(uint32_t spi_periph, uint8_t dma);
/* configure SPI total number of data transmitting by DMA is odd or not */
void spi_transmit_odd_config(uint32_t spi_periph, uint16_t odd);
/* configure SPI total number of data receiving by DMA is odd or not */
void spi_receive_odd_config(uint32_t spi_periph, uint16_t odd);
/* configure SPI access size to FIFO(8-bit or 16-bit) */
void spi_fifo_access_size_config(uint32_t spi_periph, uint16_t fifo_access_size);

/* SPI/I2S transfer configure functions */
/* configure SPI/I2S data frame format */
ErrStatus spi_i2s_data_frame_format_config(uint32_t spi_periph, uint16_t frame_format);
/* configure SPI bidirectional transfer direction */
void spi_bidirectional_transfer_config(uint32_t spi_periph, uint32_t transfer_direction);
/* SPI transmit data */
void spi_i2s_data_transmit(uint32_t spi_periph, uint16_t data);
/* SPI receive data */
uint16_t spi_i2s_data_receive(uint32_t spi_periph);

